vovaok/stm32-plus-plus/src/gpio.h
    /*! Predefined pin configurations.
        You can construct a pin with one of these configurations.
    */
#if !defined(STM32F37X)
    typedef enum
    {
        NoConfig =          PINCONFIG(noPin, flagsDefault, afNone, 0x00), //!< empty configuration
        // timers
        // TIM1
        TIM1_BKIN_PA6 =     PINCONFIG(PA6,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        TIM1_CH1N_PA7 =     PINCONFIG(PA7,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        TIM1_CH1_PA8 =      PINCONFIG(PA8,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x11), //!<.
        TIM1_CH2_PA9 =      PINCONFIG(PA9,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x12), //!<.
        TIM1_CH3_PA10 =     PINCONFIG(PA10, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x13), //!<.
        TIM1_CH4_PA11 =     PINCONFIG(PA11, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x14), //!<.
        TIM1_ETR_PA12 =     PINCONFIG(PA12, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        TIM1_CH2N_PB0 =     PINCONFIG(PB0,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x12), //!<.
        TIM1_CH3N_PB1 =     PINCONFIG(PB1,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x13), //!<.
        TIM1_BKIN_PB12 =    PINCONFIG(PB12, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        TIM1_CH1N_PB13 =    PINCONFIG(PB13, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x11), //!<.
        TIM1_CH2N_PB14 =    PINCONFIG(PB14, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x12), //!<.
        TIM1_CH3N_PB15 =    PINCONFIG(PB15, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x13), //!<.
        TIM1_ETR_PE7 =      PINCONFIG(PE7,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        TIM1_CH1N_PE8 =     PINCONFIG(PE8,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x11), //!<.
        TIM1_CH1_PE9 =      PINCONFIG(PE9,  modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x11), //!<.
        TIM1_CH2N_PE10 =    PINCONFIG(PE10, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x12), //!<.
        TIM1_CH2_PE11 =     PINCONFIG(PE11, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x12), //!<.
        TIM1_CH3N_PE12 =    PINCONFIG(PE12, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x13), //!<.
        TIM1_CH3_PE13 =     PINCONFIG(PE13, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x13), //!<.
        TIM1_CH4_PE14 =     PINCONFIG(PE14, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x14), //!<.
        TIM1_BKIN_PE15 =    PINCONFIG(PE15, modeAF | outPushPull | pullNone | speed50MHz, afTim1, 0x10), //!<.
        // TIM2
        TIM2_CH1_PA0 =      PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x21), //!<.
        TIM2_CH2_PA1 =      PINCONFIG(PA1,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x22), //!<.
        TIM2_CH3_PA2 =      PINCONFIG(PA2,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x23), //!<.
        TIM2_CH4_PA3 =      PINCONFIG(PA3,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x24), //!<.
        TIM2_CH1_PA5 =      PINCONFIG(PA5,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x21), //!<.
        TIM2_CH1_PA15 =     PINCONFIG(PA15, modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x21), //!<.
        TIM2_CH2_PB3 =      PINCONFIG(PB3,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x22), //!<.
        TIM2_CH3_PB10 =     PINCONFIG(PB10, modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x23), //!<.
        TIM2_CH4_PB11 =     PINCONFIG(PB11, modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x24), //!<.
        TIM2_ETR_PA0 =      PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x20), //!<.
        TIM2_ETR_PA5 =      PINCONFIG(PA5,  modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x20), //!<.
        TIM2_ETR_PA15 =     PINCONFIG(PA15, modeAF | outPushPull | pullNone | speed50MHz, afTim2, 0x20), //!<.
        // TIM3
        TIM3_CH1_PA6 =      PINCONFIG(PA6,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x31), //!<.
        TIM3_CH2_PA7 =      PINCONFIG(PA7,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x32), //!<.
        TIM3_CH3_PB0 =      PINCONFIG(PB0,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x33), //!<.
        TIM3_CH4_PB1 =      PINCONFIG(PB1,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x34), //!<.
        TIM3_CH1_PB4 =      PINCONFIG(PB4,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x31), //!<.
        TIM3_CH2_PB5 =      PINCONFIG(PB5,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x32), //!<.
        TIM3_CH1_PC6 =      PINCONFIG(PC6,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x31), //!<.
        TIM3_CH2_PC7 =      PINCONFIG(PC7,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x32), //!<.
        TIM3_CH3_PC8 =      PINCONFIG(PC8,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x33), //!<.
        TIM3_CH4_PC9 =      PINCONFIG(PC9,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x34), //!<.
        TIM3_ETR     =      PINCONFIG(PD2,  modeAF | outPushPull | pullNone | speed50MHz, afTim3, 0x30), //!<.
        // TIM4
        TIM4_CH1_PB6 =      PINCONFIG(PB6,  modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x41), //!<.
        TIM4_CH2_PB7 =      PINCONFIG(PB7,  modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x42), //!<.
        TIM4_CH3_PB8 =      PINCONFIG(PB8,  modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x43), //!<.
        TIM4_CH4_PB9 =      PINCONFIG(PB9,  modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x44), //!<.
        TIM4_CH1_PD12 =     PINCONFIG(PD12, modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x41), //!<.
        TIM4_CH2_PD13 =     PINCONFIG(PD13, modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x42), //!<.
        TIM4_CH3_PD14 =     PINCONFIG(PD14, modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x43), //!<.
        TIM4_CH4_PD15 =     PINCONFIG(PD15, modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x44), //!<.
        TIM4_ETR =          PINCONFIG(PE0,  modeAF | outPushPull | pullNone | speed50MHz, afTim4, 0x40), //!<.
        // TIM5
        TIM5_CH1_PA0 =      PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x51), //!<.
        TIM5_CH2_PA1 =      PINCONFIG(PA1,  modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x52), //!<.
        TIM5_CH3_PA2 =      PINCONFIG(PA2,  modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x53), //!<.
        TIM5_CH4_PA3 =      PINCONFIG(PA3,  modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x54), //!<.
        TIM5_CH1_PH10 =     PINCONFIG(PH10, modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x51), //!<.
        TIM5_CH2_PH11 =     PINCONFIG(PH11, modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x52), //!<.
        TIM5_CH3_PH12 =     PINCONFIG(PH12, modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x53), //!<.
        TIM5_CH4_PI0 =      PINCONFIG(PI0,  modeAF | outPushPull | pullNone | speed50MHz, afTim5, 0x54), //!<.
        // TIM8
        TIM8_ETR_PA0 =      PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x80), //!<.
        TIM8_CH1N_PA5 =     PINCONFIG(PA5,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x81), //!<.
        TIM8_BKIN_PA6 =     PINCONFIG(PA6,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x80), //!<.
        TIM8_CH1N_PA7 =     PINCONFIG(PA7,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x81), //!<.
        TIM8_CH2N_PB0 =     PINCONFIG(PB0,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x82), //!<.
        TIM8_CH3N_PB1 =     PINCONFIG(PB1,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x83), //!<.
        TIM8_CH2N_PB14 =    PINCONFIG(PB14, modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x82), //!<.
        TIM8_CH3N_PB15 =    PINCONFIG(PB15, modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x83), //!<.
        TIM8_CH1_PC6 =      PINCONFIG(PC6,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x81), //!<.
        TIM8_CH2_PC7 =      PINCONFIG(PC7,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x82), //!<.
        TIM8_CH3_PC8 =      PINCONFIG(PC8,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x83), //!<.
        TIM8_CH4_PC9 =      PINCONFIG(PC9,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x84), //!<.
        TIM8_CH1N_PH13 =    PINCONFIG(PH13, modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x81), //!<.
        TIM8_CH2N_PH14 =    PINCONFIG(PH14, modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x82), //!<.
        TIM8_CH3N_PH15 =    PINCONFIG(PH15, modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x83), //!<.
        TIM8_CH4_PI2 =      PINCONFIG(PI2,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x84), //!<.
        TIM8_ETR_PI3 =      PINCONFIG(PI3,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x80), //!<.
        TIM8_BKIN_PI4 =     PINCONFIG(PI4,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x80), //!<.
        TIM8_CH1_PI5 =      PINCONFIG(PI5,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x81), //!<.
        TIM8_CH2_PI6 =      PINCONFIG(PI6,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x82), //!<.
        TIM8_CH3_PI7 =      PINCONFIG(PI7,  modeAF | outPushPull | pullNone | speed50MHz, afTim8, 0x83), //!<.
        // TIM9
        TIM9_CH1_PA2 =      PINCONFIG(PA2,  modeAF | outPushPull | pullNone | speed50MHz, afTim9, 0x91), //!<.
        TIM9_CH2_PA3 =      PINCONFIG(PA3,  modeAF | outPushPull | pullNone | speed50MHz, afTim9, 0x92), //!<.
        TIM9_CH1_PE5 =      PINCONFIG(PE5,  modeAF | outPushPull | pullNone | speed50MHz, afTim9, 0x91), //!<.
        TIM9_CH2_PE6 =      PINCONFIG(PE6,  modeAF | outPushPull | pullNone | speed50MHz, afTim9, 0x92), //!<.
        // TIM10
        TIM10_CH1_PB8 =     PINCONFIG(PB8,  modeAF | outPushPull | pullNone | speed50MHz, afTim10, 0xA1), //!<.
        TIM10_CH1_PF6 =     PINCONFIG(PF6,  modeAF | outPushPull | pullNone | speed50MHz, afTim10, 0xA1), //!<.
        // TIM11
        TIM11_CH1_PB9 =     PINCONFIG(PB9,  modeAF | outPushPull | pullNone | speed50MHz, afTim11, 0xB1), //!<.
        TIM11_CH1_PF7 =     PINCONFIG(PF7,  modeAF | outPushPull | pullNone | speed50MHz, afTim11, 0xB1), //!<.
        // TIM12
        TIM12_CH1_PB14 =    PINCONFIG(PB14, modeAF | outPushPull | pullNone | speed50MHz, afTim12, 0xC1), //!<.
        TIM12_CH2_PB15 =    PINCONFIG(PB15, modeAF | outPushPull | pullNone | speed50MHz, afTim12, 0xC2), //!<.
        TIM12_CH1_PH6 =     PINCONFIG(PH6,  modeAF | outPushPull | pullNone | speed50MHz, afTim12, 0xC1), //!<.
        TIM12_CH2_PH9 =     PINCONFIG(PH9,  modeAF | outPushPull | pullNone | speed50MHz, afTim12, 0xC2), //!<.
        // TIM13
        TIM13_CH1_PA6 =     PINCONFIG(PA6,  modeAF | outPushPull | pullNone | speed50MHz, afTim13, 0xD1), //!<.
        TIM13_CH1_PF8 =     PINCONFIG(PF8,  modeAF | outPushPull | pullNone | speed50MHz, afTim13, 0xD1), //!<.
        // TIM14
        TIM14_CH1_PA7 =     PINCONFIG(PA7,  modeAF | outPushPull | pullNone | speed50MHz, afTim14, 0xE1), //!<.
        TIM14_CH1_PF9 =     PINCONFIG(PF9,  modeAF | outPushPull | pullNone | speed50MHz, afTim14, 0xE1), //!<.        
        // USART1
        USART1_CK_PA8 =     PINCONFIG(PA8,  modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        USART1_TX_PA9 =     PINCONFIG(PA9,  modeAF | outPushPull | pullUp   | speed50MHz, afUsart1, 0x10), //!<.
        USART1_RX_PA10 =    PINCONFIG(PA10, modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        USART1_CTS_PA11 =   PINCONFIG(PA11, modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        USART1_RTS_PA12 =   PINCONFIG(PA12, modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        USART1_TX_PB6 =     PINCONFIG(PB6,  modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        USART1_RX_PB7  =    PINCONFIG(PB7,  modeAF | outPushPull | pullNone | speed50MHz, afUsart1, 0x10), //!<.
        // USART2
        USART2_CTS_PA0 =    PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_RTS_PA1 =    PINCONFIG(PA1,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_TX_PA2 =     PINCONFIG(PA2,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_RX_PA3 =     PINCONFIG(PA3,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_CK_PA4 =     PINCONFIG(PA4,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_CTS_PD3 =    PINCONFIG(PD3,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_RTS_PD4 =    PINCONFIG(PD4,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_TX_PD5 =     PINCONFIG(PD5,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_RX_PD6 =     PINCONFIG(PD6,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        USART2_CK_PD7 =     PINCONFIG(PD7,  modeAF | outPushPull | pullNone | speed50MHz, afUsart2, 0x20), //!<.
        // USART 3
        USART3_TX_PB10 =    PINCONFIG(PB10, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_RX_PB11 =    PINCONFIG(PB11, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_CK_PB12 =    PINCONFIG(PB12, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_CTS_PB13 =   PINCONFIG(PB13, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_RTS_PB14 =   PINCONFIG(PB14, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_TX_PC10 =    PINCONFIG(PC10, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_RX_PC11 =    PINCONFIG(PC11, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_CK_PC12 =    PINCONFIG(PC12, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_TX_PD8 =     PINCONFIG(PD8,  modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_RX_PD9 =     PINCONFIG(PD9,  modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_CK_PD10 =    PINCONFIG(PD10, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_CTS_PD11 =   PINCONFIG(PD11, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        USART3_RTS_PD12 =   PINCONFIG(PD12, modeAF | outPushPull | pullNone | speed50MHz, afUsart3, 0x30), //!<.
        // UART4
        UART4_TX_PA0 =      PINCONFIG(PA0,  modeAF | outPushPull | pullNone | speed50MHz, afUart4, 0x40), //!<.
        UART4_RX_PA1 =      PINCONFIG(PA1,  modeAF | outPushPull | pullNone | speed50MHz, afUart4, 0x40), //!<.
        UART4_TX_PC10 =     PINCONFIG(PC10, modeAF | outPushPull | pullNone | speed50MHz, afUart4, 0x40), //!<.
        UART4_RX_PC11 =     PINCONFIG(PC11, modeAF | outPushPull | pullNone | speed50MHz, afUart4, 0x40), //!<.
        // UART5
        UART5_TX_PC12 =     PINCONFIG(PC12, modeAF | outPushPull | pullNone | speed50MHz, afUart5, 0x50), //!<.
        UART5_RX_PD2 =      PINCONFIG(PD2,  modeAF | outPushPull | pullNone | speed50MHz, afUart5, 0x50), //!<.
        // USART6
        USART6_TX_PC6 =     PINCONFIG(PC6,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_RX_PC7 =     PINCONFIG(PC7,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_CK_PC8 =     PINCONFIG(PC8,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_CK_PG7 =     PINCONFIG(PG7,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_RTS_PG8 =    PINCONFIG(PG8,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_RX_PG9 =     PINCONFIG(PG9,  modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_RTS_PG12 =   PINCONFIG(PG12, modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_CTS_PG13 =   PINCONFIG(PG13, modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_TX_PG14 =    PINCONFIG(PG14, modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        USART6_CTS_PG15 =   PINCONFIG(PG15, modeAF | outPushPull | pullNone | speed50MHz, afUsart6, 0x60), //!<.
        // CAN1
        CAN1_RX_PA11 =      PINCONFIG(PA11, modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_TX_PA12 =      PINCONFIG(PA12, modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_RX_PB8 =       PINCONFIG(PB8,  modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_TX_PB9 =       PINCONFIG(PB9,  modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_RX_PD0 =       PINCONFIG(PD0,  modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_TX_PD1 =       PINCONFIG(PD1,  modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_RX_PI9 =       PINCONFIG(PI9,  modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        CAN1_TX_PH13 =      PINCONFIG(PH13, modeAF | outPushPull | pullUp | speed50MHz, afCan1, 0x10), //!<.
        // CAN2
        CAN2_RX_PB5 =       PINCONFIG(PB5,  modeAF | outPushPull | pullUp | speed50MHz, afCan2, 0x20), //!<.
        CAN2_TX_PB6 =       PINCONFIG(PB6,  modeAF | outPushPull | pullUp | speed50MHz, afCan2, 0x20), //!<.
        CAN2_RX_PB12 =      PINCONFIG(PB12, modeAF | outPushPull | pullUp | speed50MHz, afCan2, 0x20), //!<.
        CAN2_TX_PB13 =      PINCONFIG(PB13, modeAF | outPushPull | pullUp | speed50MHz, afCan2, 0x20), //!<.
        
