vovaok/stm32-plus-plus/src/gpio.h
        //I2C
        I2C2_SCL_PH4 =      PINCONFIG(PH4,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C2_SDA_PH5 =      PINCONFIG(PH5,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C2_SCL_PB10 =     PINCONFIG(PB10,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C2_SDA_PB11 =     PINCONFIG(PB11,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C2_SMBA_PH6 =     PINCONFIG(PH6,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C3_SCL_PH7 =      PINCONFIG(PH7,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C3_SDA_PH8  =     PINCONFIG(PH8,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C3_SMBA_PH9 =     PINCONFIG(PH9,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C2_SMBA_PB12  =   PINCONFIG(PB12,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C2, 0x20), //!<.
        I2C3_SDA_PC9  =     PINCONFIG(PC9,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C3_SCL_PA8  =     PINCONFIG(PA8,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C3_SMBA_PA9  =    PINCONFIG(PA9,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C3, 0x30), //!<.
        I2C1_SMBA_PB5  =    PINCONFIG(PB5,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C1, 0x10), //!<.
        I2C1_SCL_PB6  =     PINCONFIG(PB6,  modeAF | outOpenDrain| pullNone | speed50MHz, afI2C1, 0x10), //!<.
        I2C1_SDA_PB7  =     PINCONFIG(PB7,  modeAF | outOpenDrain| pullNone | speed50MHz, afI2C1, 0x10), //!<.
        I2C1_SCL_PB8  =     PINCONFIG(PB8,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C1, 0x10), //!<.
        I2C1_SDA_PB9  =     PINCONFIG(PB9,  modeAF | outOpenDrain| pullUp | speed50MHz, afI2C1, 0x10), //!<.
          
        // DAC
        DAC_OUT1_PA4  =     PINCONFIG(PA4,  modeAnalog, afNone, 0x11), //!<.
        DAC_OUT2_PA5  =     PINCONFIG(PA5,  modeAnalog, afNone, 0x12), //!<.
          
          
          
        
        // SPI (I2S)
        SPI1_NSS_PA4 =      PINCONFIG(PA4,  modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI1_SCK_PA5 =      PINCONFIG(PA5,  modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI1_MISO_PA6 =     PINCONFIG(PA6,  modeAF | speed50MHz | pullUp , afSpi1, 0x10), //!.
        SPI1_MOSI_PA7 =     PINCONFIG(PA7,  modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI1_NSS_PA15 =     PINCONFIG(PA15, modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI1_SCK_PB3 =      PINCONFIG(PB3,  modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI1_MISO_PB4 =     PINCONFIG(PB4,  modeAF | speed50MHz | pullUp, afSpi1, 0x10), //!.
        SPI1_MOSI_PB5 =     PINCONFIG(PB5,  modeAF | speed50MHz, afSpi1, 0x10), //!.
        SPI2_NSS_PB9 =      PINCONFIG(PB9,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_WS_PB9 =       PINCONFIG(PB9,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_SCK_PB10 =     PINCONFIG(PB10, modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_CK_PB10 =      PINCONFIG(PB10, modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_NSS_PB12 =     PINCONFIG(PB12, modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_WS_PB12 =      PINCONFIG(PB12, modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_SCK_PB13 =     PINCONFIG(PB13, modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_CK_PB13 =      PINCONFIG(PB13, modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_MISO_PB14 =    PINCONFIG(PB14, modeAF | speed50MHz | pullDown, afSpi2, 0x20), //!.
        SPI2_MOSI_PB15 =    PINCONFIG(PB15, modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_SD_PB15 =      PINCONFIG(PB15, modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_MISO_PC2 =     PINCONFIG(PC2,  modeAF | speed50MHz | pullUp, afSpi2, 0x20), //!.
        SPI2_MOSI_PC3 =     PINCONFIG(PC3,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_SD_PC3 =       PINCONFIG(PC3,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_MCK_PC6 =      PINCONFIG(PC6,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S_CKIN_PC9 =      PINCONFIG(PC9,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_NSS_PI0 =      PINCONFIG(PI0,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_WS_PI0 =       PINCONFIG(PI0,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_SCK_PI1 =      PINCONFIG(PI1,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_CK_PI1 =       PINCONFIG(PI1,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        SPI2_MISO_PI2 =     PINCONFIG(PI2,  modeAF | speed50MHz | pullUp, afSpi2, 0x20), //!.
        SPI2_MOSI_PI3 =     PINCONFIG(PI3,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        I2S2_SD_PI3 =       PINCONFIG(PI3,  modeAF | speed50MHz, afSpi2, 0x20), //!.
        // nedodelano I2S2ext!!!!!
        SPI3_NSS_PA4 =      PINCONFIG(PA4,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_WS_PA4 =       PINCONFIG(PA4,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        SPI3_NSS_PA15 =     PINCONFIG(PA15, modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_WS_PA15 =      PINCONFIG(PA15, modeAF | speed50MHz, afSpi3, 0x30), //!.
        SPI3_SCK_PB3 =      PINCONFIG(PB3,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_CK_PB3 =       PINCONFIG(PB3,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        SPI3_MISO_PB4 =     PINCONFIG(PB4,  modeAF | speed50MHz | pullUp, afSpi3, 0x30), //!.
        SPI3_MOSI_PB5 =     PINCONFIG(PB5,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_SD_PB5 =       PINCONFIG(PB5,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_MCK_PC7 =      PINCONFIG(PC7,  modeAF | speed50MHz, afSpi3, 0x30), //!.
        SPI3_SCK_PC10 =     PINCONFIG(PC10, modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_CK_PC10 =      PINCONFIG(PC10, modeAF | speed50MHz, afSpi3, 0x30), //!.
        SPI3_MISO_PC11 =    PINCONFIG(PC11, modeAF | speed50MHz | pullUp, afSpi3, 0x30), //!.
        SPI3_MOSI_PC12 =    PINCONFIG(PC12, modeAF | speed50MHz, afSpi3, 0x30), //!.
        I2S3_SD_PC12 =      PINCONFIG(PC12, modeAF | speed50MHz, afSpi3, 0x30), //!.
        // nedodelano I2S3ext
        // OTG_FS
        OTG_FS_SOF =        PINCONFIG(PA8,  modeAF | speed100MHz, afOtgFs, 0x10), //!<.
      //  OTG_FS_VBUS =       PINCONFIG(PA9,  modeAF | speed100MHz, afOtgFs, 0x10), //!<.
      //  OTG_FS_ID =         PINCONFIG(PA10, modeAF | outOpenDrain | pullUp | speed100MHz, afOtgFs, 0x10), //!<.
        OTG_FS_DM =         PINCONFIG(PA11, modeAF | speed100MHz, afOtgFs, 0x10), //!<.
        OTG_FS_DP =         PINCONFIG(PA12, modeAF | speed100MHz, afOtgFs, 0x10), //!<.
        // OTG_HS
        OTG_HS_SOF =        PINCONFIG(PA4,  modeAF | speed100MHz, afOtgHsFs, 0x20), //!<.
        OTG_HS_ID =         PINCONFIG(PB12, modeAF | speed100MHz, afOtgHsFs, 0x20), //!<.
        OTG_HS_VBUS =       PINCONFIG(PB13, modeIn | speed100MHz, afNone   , 0x20), //!<.
        OTG_HS_DM =         PINCONFIG(PB14, modeAF | speed100MHz, afOtgHsFs, 0x20), //!<.
        OTG_HS_DP =         PINCONFIG(PB15, modeAF | speed100MHz, afOtgHsFs, 0x20), //!<.
        // OTG_HS (ULPI)
        OTG_HS_ULPI_D0 =    PINCONFIG(PA3,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D1 =    PINCONFIG(PB0,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D2 =    PINCONFIG(PB1,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D3 =    PINCONFIG(PB10, modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D4 =    PINCONFIG(PB11, modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D5 =    PINCONFIG(PB12, modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D6 =    PINCONFIG(PB13, modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_D7 =    PINCONFIG(PB5,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_CLK =   PINCONFIG(PA5,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_NXT =   PINCONFIG(PC3,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_DIR =   PINCONFIG(PC2,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_STP =   PINCONFIG(PC0,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_NXT_PH4=PINCONFIG(PH4,  modeAF | speed100MHz, afOtgHs, 0x21), //!<.
        OTG_HS_ULPI_DIR_PI11=PINCONFIG(PI11,modeAF | speed100MHz, afOtgHs, 0x21), //!<.\n to be continued....
    } Config;
#else
    
