vovaok/stm32-plus-plus/src/gpio.h
private:
    typedef union
    {
        Config config;
        struct
        {
            unsigned char pin;
            unsigned char flags;
            unsigned char af;
            unsigned char periph; // peripheral index
        };
        struct
        {
            unsigned char pinNumber: 4;
            unsigned char portNumber: 4;
            unsigned char mode: 2;
            unsigned char outType: 1;
            unsigned char pull: 2;
            unsigned char speed: 2;
            unsigned char manyPins: 1; // several pins of port used, 'mPin' variable contains mask
            unsigned char afNumber;
            unsigned char channel: 4;
            unsigned char periphNumber: 4;
        };
        struct
        {
            unsigned short _dummy;
            unsigned short mask;
        };
    } ConfigStruct;
  
    static unsigned char mPinsUsed[140];
    static void usePin(const ConfigStruct &cfg);
    ConfigStruct mConfig;
    GPIO_TypeDef *mPort;
    unsigned short mPin;
    
    void init();
    static GPIO_TypeDef *getPortByNumber(int port);
    void updateConfig();
//    void setFlags(Flags flags);
    
public:
    /*! Constructor with explicit pin configuration.
        You should use it if there is not necessary configuration available.
        But other constructor is more convenient.
    */
    Gpio(PinName pin, Flags flags = flagsDefault/*, PinAF altFunction = afNone*/);
    
    /*! Constructor with predefined pin configuration.
        Convenient for fast configuration.
    */
    Gpio(Config config);
    
    /*! Construct Gpio object with many pins of port handling.
        You should use it if there is not necessary configuration available.
        But other constructor is more convenient.
    */
    Gpio(PortName port, unsigned short mask = 0xFFFF, Flags flags = flagsDefault);
    
    /*! Initialize pin with explicit configuration.
        This function is useful when you not need to create an instance
        for manipulating the pin in the future.\n
        Try better using another implementation that accepts predefined config.
    */
    static void config(PinName pin, Flags flags = flagsDefault, PinAF altFunction = afNone);
    
    /*! Initialize pin with predefined configuration.
        This function is useful when you not need to create an instance
        for manipulating the pin in the future.\n
        \b Note: Use of this function is preferred.
        \param conf Pin configuration, see Config for details.
    */
    static void config(const Config &conf);
    
    /*! Initialize \c count pins with predefined configurations.
        Convenient when initializing several pins in one line of code.
        Using example: config(2, CAN_RX_PB8, CAN_TX_PB9);
        \param count The count of the pins to configure.
        \param conf1 Configuration of the first pin.
    */
    static void config(int count, Config conf1, ...);
    
    /*! Получение номера блока периферии.
        Номер периферии определяется по конфигурации, переданной в конструктор.
        \return значение номера блока периферии. 
        \example
        Gpio thePin(Gpio::TIM2_CH1_PA0);
        int timerNumber = thePin.periphNumber(); // timerNumber will be 2
    */
    inline unsigned char periphNumber() const {return mConfig.periphNumber;}
    
    /*! Получение номера канала периферии.
        Канал периферии определяется по конфигурации, переданной в конструктор.
        \return значение номера канала периферии.
        Если данный блок периферии не имеет каналов, возвращаемое значение равно 0.
        \example
        Gpio thePin(Gpio::TIM2_CH1_PA0);
        int channelNumber = thePin.channelNumber(); // channelNumber will be 1
    */
    inline unsigned char channelNumber() const {return mConfig.channel;}
    
    /*! Изменение конфигурации как вход без подтяжки.
        По идее, можно вызывать в любое время.
    */
    void setAsInput();
    
    /*! Изменение конфигурации как вход с подтяжкой к питанию.
        По идее, можно вызывать в любое время.
    */
    void setAsInputPullUp();
    
    /*! Изменение конфигурации как вход с подтяжкой к земле.
        По идее, можно вызывать в любое время.
    */
    void setAsInputPullDown();
    
    /*! Изменение конфигурации как выход.
        По идее, можно вызывать в любое время.
    */
    void setAsOutput();
    
    /*! Изменение конфигурации как выход с открытым стоком.
        По идее, можно вызывать в любое время.
    */
    void setAsOutputOpenDrain();
    
    /*! Чтение состояния ноги. 
        \return \c true, если на ноге 1, \c false, если 0. Что логично.
    */
    bool read() const;
    
    /*! Запись состояния ноги.
        \param value \c true, чтобы выставить 1, \c false - 0. И это нормально.
    */
    void write(bool value);
    
#if defined (STM32F37X)
    /*! Установка ноги в 1 */
    inline void set() {mPort->BSRR = mPin;}   
    /*! Сброс ноги в 0 */
    inline void reset() {mPort->BRR = mPin;}
#else
    /*! Установка ноги в 1 */
    inline void set() {mPort->BSRRL = mPin;}   
    /*! Сброс ноги в 0 */
    inline void reset() {mPort->BSRRH = mPin;}
#endif
    
    /*! Инверсия состояния ноги */
    inline void toggle() {mPort->ODR ^= mPin;}
    
    /*! запись порта*/
    void writePort(unsigned short value);

    /*! чтение порта*/
    unsigned short readPort();
    
    /*! что за нога? */
    PinName pin() const {return static_cast<Gpio::PinName>(mConfig.pin);}
    
    /*! Возвращает false, если при конфигурации нога задана как Gpio::noPin */
    bool isValid() const {return mPin;}
};

#endif
